Revit 2027 API
LabelUtils.GetFailureSeverityName Method
 Gets the user-visible name for the Severity of a Warning
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetFailureSeverityName(
	FailureSeverity failureSeverity
)
Public Shared Function GetFailureSeverityName (
	failureSeverity As FailureSeverity
) As String
public:
static String^ GetFailureSeverityName(
	FailureSeverity failureSeverity
)
static member GetFailureSeverityName :
        failureSeverity : FailureSeverity -> string
Parameters
failureSeverity FailureSeverity
 The Severity enum value
Return Value
String
 Returns the user-visible name for the Severity of a Warning.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The name is obtained in the current Revit language.
See Also
Reference
LabelUtils Class
Autodesk.Revit.DB Namespace